import type { FAQItem } from '../types';

export const faqData: FAQItem[] = [
  {
    id: 'faq-1',
    question: '何歳から入会できますか？',
    answer: '4歳からご入会いただけます！（バトンビギナークラス、チアダンス一般クラス）',
  },
  {
    id: 'faq-2',
    question: '体験レッスンや見学は出来ますか？',
    answer: '募集期間内であれば1レッスン1,000円（各クラス1回まで）で受けていただけます。',
  },
  {
    id: 'faq-3',
    question: 'レッスン、体験レッスンに必要なものは何ですか？',
    answer: '上靴（動きやすいスニーカーなど）、飲み物、タオル、（ゆったりYOGAはヨガマットorバスタオル）をお持ちください。当日は動きやすい服装でお越しください♪',
  },
  {
    id: 'faq-4',
    question: 'レッスン中、保護者の見学はできますか？',
    answer: '見学していただけます。ただ、写真や動画の撮影はお控えください。',
  },
  {
    id: 'faq-5',
    question: 'お月謝以外にかかる費用はありますか？',
    answer: '衣装代や道具代（バトン、ポンポン）は別途必要になります。その他、イベントの参加費や遠方のイベントだと遠征費がかかります。イベントへの参加は任意です。',
  },
  {
    id: 'faq-6',
    question: 'お月謝のお支払い方法は何がありますか？',
    answer: '口座振替もしくはクレジットカードからお選びいただけます！（原則現金でのお支払いはできません）',
  },
];
